export const initialTeamPoints = [
  {
    color: 'red',
    text: 'Ваша команда собирается на волейбольном поле',
  },
  {
    color: 'aqua',
    text: 'Подойдите к качелям - это ваша точка встречи',
  },
  {
    color: 'violet',
    text: 'Вам нужно идти к домикам у крепости',
  },
  {
    color: 'orange',
    text: 'Ваше место встречи - около душей)',
  },
  {
    color: 'green',
    text: 'Вы собираетесь командой в столовой',
  },
  {
    color: 'blue',
    text: 'Точка встречи вашей команды - общий зал',
  },
];
