{
    "1": ["Ресайзер", "Это - кольцо изменения размера шрифта. Если потянуть его вниз/вверх, то шрифт текста песни уменьшится/увеличится на @declension(){{$step}{$step пункт}{$step пункта}{$step пунктов}}. Если потянуть вправо, появится серый кружок с текущим значением величины шрифта@declension($curr){{$curr}{ (сейчас это $curr пункт)}{ (сейчас это $curr пункта)}{ (сейчас это $curr пунктов)}}. Протяни палец до его уровня, и шрифт возможно будет установить в нужное значение интерактивно."]
  , "2": ["Кнопка навигации", "Переход на уровень выше осуществляется по нажатию на эту кнопку, или системную кнопку Назад."]
  , "": ["", ""]
  , "4": ["Новая категория", "Впиши в строку поиска категорий новое название. Если новая категория - это существующий сборник, то назови категорию с большой буквы, если нет, то с маленькой. Нажми на #shakeThis[[эту кнопку][sizing]], и будет добавлена категория."]
  , "5": ["Кнопка категории", "Открыть список прикреплённых песен к категории можно по нажатию на такую кнопку."]
  , "6": ["Название категории", "Поменять название текущей категории можно нажав на этот заголовок."]
  , "7": ["Удаление категории", "$comsLen?{{Такое действие влечёт за собой потерю данных о прикреплённых к категории \"$ccatn\" песен, @declension[[$comsLen][как раз $comsLen песня здесь есть][а их сейчас тут $comsLen штуки][а их здесь аж $comsLen штук!]]}{Удалить категорию лучше тогда, когда к ней ещё не прикреплены песни. В данном случае это и будет справедливо сказано о категории \"$ccatn\".}}"]
  , "8": ["Создание новой песни", "Впиши в строку поиска название песни которую ты добавляешь. Убедись, что такой песни нет в списке! Если ты хочешь, чтоб названием стала первая строчка песни, напиши в строке поиска знак вопроса (?) и нажми на #shakeThis[[кнопку создания]]. Первая строка из песни станет названием тогда, когда ты вставишь в поле ввода текстов сам текст песни. Если название будет не подходящим, то выйдет сообщение об ошибке."]
  , "9": ["Кнопка песни", "Песни отсортированы по алфавиту. Им выданы порядковые номера, но может быть обозначен нативный номер внешнего сборника$comNativeNum[[, например, песня \"$comName\" в сборнике \"$ccatName\" находится под номером №$comNativeNum (это её так называемый \"нативный номер\")][, соответствующего текущей категории (в данном случае это \"$ccatName\")]]"]
  , "10": ["Номер песни", "Это кнопка, которая отображает номер текущей песни$comi?{{ (#$comi)}} в текущей категории$catn{{ (сейчас это $catn)}}$comi!{{. Сейчас @shakeSongNumber[[номер песни отсутствует][color-highlight]], т.к. текущая категория не содержит такой песни. Также будут отсутствовать номера песен в @shakeMarkedButtons[[списке избранного]]}}. При нажатии на $comi?{{неё}{@shakeSongNumber[[эту кнопку]]}} можно $isMarked?{{удалить/добавить песню в @shakeMarkedButtons[[список избранного]]}{добавить/удалить песню из @shakeMarkedButtons[[списка избранного]]}}. В данный момент она $isMarked?{{в нём состоит.}{вне списка избранного.}} #swipeDownComNum[[Потяни за номер вниз][violet]], и увидишь список нативных номеров по категориям. #nativeNumbersExistsMessage[[Сейчас в песне о них информации нет.]]"]
  , "11": ["Переключатель аккордов \"$label\"", "У отображения аккордов есть три состояния: без аккордов$var1{{ (кнопка #shakeVar[[$var1][0]])}}, минимальный набор$var2{{ (кнопка #shakeVar[[$var2][1]])}}, и максимальный набор аккордов$var3{{ (кнопка #shakeVar[[$var3][2]])}}. Соответственно, в режиме без аккордов будет показан только текст песни, при включённом режиме #shakeVar[[$var2][1]] будут показаны аккорды только в тех текстах, где соответствующий набор аккордов встречается впервые. Она может быть неактивной. Такое встречается в песнях, где минимальное количество блоков аккордов совпадает с общим количеством блоков текстов#isMinWholeChords{{. Сейчас она, как раз, и не активна}}. При выборе же максимального количества аккордов будут показаны аккорды над каждой строчкой текста. В данный момент включён режим #shakeVar[[$currVar][$currV]], о чём свидетельствует признак подсвечености кнопки. При выборе режима #shakeVar[[$var1][0]] модуляция аккордов запрещена, поэтому #shakeTransports[[кнопки транспонирования]]$currV?{{ будут}} неактивны."]
  , "12": ["Транспонироавние аккордов", "У каждой песни есть определённая тональность. Чтобы спеть песню красиво, необходимо держаться в одной тональности до конца песни, или пока не произошла модуляция песни (изменение тональности во время хода мелодии). Но, иногда бывает, что в песне неудобная тональность, для этого и придумано транспонирование. Транспонировать песню - значит одновременно поднять или опустить каждую ноту во всей композиции. Эти #tr[[кнопки]] и служат для транспонирования #down[[на полутон вниз]] и #up[[на полутон вверх]]. Если в песне будет отключён показ аккордов (т.е. отключено #variantNot[[этой кнопкой]]$isChordsHidden?[[, как сейчас и есть]]), то #tr[[кнопки транспонирования]] будут недоступны!"]
  , "13": ["Редактор песен", "Для перехода в режим редактирования песен нажми на эту кнопку."]
  , "": ["", ""]
  , "24": ["Бокс затакта", "Установить затактовый аккорд."]
  , "25": ["Бокс аккорда", "На гласные буквы и пробелы можно апплицировать аккорды. Просто нажми на гласную букву, и она окрасится в салатовый цвет. Это означает, что там ожидается аппликация аккорда. Если над #shakeThis[[боксом]] аккорд не появился, то количество аккордов в данной строке в блоке аккордов во @shakeEditorPhaseTab[[c][вкладке аккордов]] меньше, чем аппликаций в данной строке. Оранжевым фоном подсвечены аппликации, унаследованные с предыдущей строки."]
  , "26": ["Посттактовый бока", "Для аппликации посттактового аккорда."]
  , "27": ["Подсказка аккордов", "Посмотри как играются аккорды, которые есть в текущей песне$isICanRedact?[[, или ты можешь отредактировать эти изображения, кликнув по необходимому #shakeChordImagines($isImaginesOpened?)[[изображению аккорда]]. Тебя переведёт в режим редактирования аккорда, где вся панель разбита на вкладки по основам аккордов. Нажми на название аккорда, тебя перекинет на панель редактирования и будет предложено поменять стартовый лад]]."]
  , "": ["", ""]
  , "30": ["Название песни", "Задай новое название песни."]
  , "31": ["Удаление песни", "Удалять песни необходимо с осторожностью. Подумай!"]
  , "32": ["Кнопка категории", "$isCantBindCom?[[Здесь можно посмотреть, к каким сборникам или категориям эта песня отнесена.][Соотнеси песню к категориям, к которым она относится. Обязательно отнеси к категории языкового различия! А также просмотри, пожалуйста, сборники, которые есть в списке категорий песен и обозначь номера по тем сборникам, где она встречается.]]"]
  , "36": ["R. Вкладка $editPhase", "#withEditPhase[[$ephasen][В режиме аппликатуры прикрепляются аккорды к слогам. Аккорд также можно прикрепить к пробелу, @shakePreTakts($isepa?){{затактовому боксу}}, или @shakePostTakts($isepa?){{посттактному боксу}}.][В режиме редактирования текстов предоставлены поля ввода текста, в которые можно вставлять тексты, поочерёдно чередующиеся строки со строками аккордов. Возможна вставка текстов вида АТАТАТ (где А - это строка аккордов, а Т - строка текстов). Также поддержтвается формат текста АААА ТТТТ, с любым количеством строк текстов и аккордов. Вставляемые тексты и аккорды разделённые двумя переносами строк разбиваются на блоки, которые впоследствии могут стать куплетами припевами, бриджами, и т.д. во вкладке редактирования @shakeEditorPhaseTab{{o}}, а также здесь сопоставляются аккорды к текстам][Здесь редактируются блоки аккордов. К написанию аккордов есть чёткие требования: у аккорда есть основа$accessedChordBases{{ (принимаются только такие базы аккордов: $accessedChordBases). Как можно заметить, аккорда \"B\" в списке нет. Вместо него всегда пишется A#}}, дальше может идти диез (#), например D#, бемоли не принимаются! Вписывай эквивалент с диезом (если не знаешь, как писать бемольные аккорды с диезом, жми @openModal{{сюда}{Правила перевода аккордов}{$tarnsportRules}}), далее маркер минорности, например Em, A#m. Далее цифры и другие буквенные обозначения, например A7, D#m7, Am2, H+. Аккорды с басовым тоном разделяются только символом слеш (/), например Gm/A#, вольты обозначаются точками перед аккордом, например .A#..C#. Здесь за первым разом играется A#, за вторым - C#][Настроить порядок блоков в песне, назначить стиль блоков, соотнести нужные блоки аккордов к определённым текстам, и др. можно сделать именно в этой вкладке редактора.]]"]
  , "": ["", ""]
  , "46": ["Стартовый лад", "Поменяй стартовый лад аккорда. используй цифры больше нуля!"]
  , "": ["", ""]
  , "53": ["Отправка изменений", "Отправляй изменения как можно чаще, по небольшим порциям. Так уменьшается вероятность потери данных. $isCanSend![[На данный момент эта кнопка недоступна, $isNoExecs?{{так как изменений нет}{так как нет отмеченных изменений}}.]]"]
  , "": ["", ""]
  , "66": ["Кнопка избранного", "Данная кнопка показывает во всю ширину или максимально скрывает @shakeMarkedButtons[[блок избранного]]. В данный момент $isOpened?{{список показан во всю ширину. По нажатию на @shakeMarksButton[[кнопку избранного]] блок будет максимально скрыт.}{он максимально скрыт. Для открытия кнопок во всю ширину нажми @shakeMarksButton[[кнопку избранного]]. Для изменения порядка песен в избранном также необходимо открыть блок полностью.}}"]
  , "67": ["Сортировка избранного", "Кнопки, на которых изображены такие стрелки ($arrUp; и $arrDown;) служат для сортировки списков. Здесь они меняют местами песни в избранном. При нажатии на #shake{{кнопку вниз ($arrDown;)}{down}} песня, напротив которой эта кнопа, переместится вниз, а нижестоящая - вместо текущей - наверх. При нажатии на #shake($isSingleMarked!){{стрелку вверх ($arrUp;)}{up}} произойдёт всё с точностью, да наоборот. Если песня в блоке избранного одна $isSingleMarked?{{(а в данном случае так и есть)}{(сейчас их $len; @declension[[$len][штука][штуки][штук]])}}, то кнопка сортировки напротив неё будет неактивна."]
  , "68": ["Избранная песня", "Это кнопка, по нажатию на которую можно быстро перейти на нужную песню. Сюда она попадает при нажатии на @shakeSongNumber[[номер песни]] "]
  , "69": ["Скрин скрытия", "Кликни по затенённой области, чтоб закрыть @shakeMarkedButtons[[блок избранного]]."]
  , "": ["", ""]
  , "74": ["Добавить блок", "По нажатию на эту кнопку в конец списка блоков добавится необходимый блок."]
  , "75": ["Удалить блок", "Для удаления блока из списка нажми на эту кнопку"]
  , "76": ["Прикрепа минималок", "Прикрепи аккорды, где соответствующий блок впервые встречается в песне. Т.е. количество блоков аккордов должно совпадать с количеством #shakeMinimals[[прекреплённых минималок]]."]
  , "": ["", ""]
  , "79": ["Сортер блоков", "Поменяй порядок блоков текстов, управляя состоянием этими кнопками."]
  , "80": ["Очистка поиска", "Это крестик, по нажатию на который очистится строка поиска."]
  , "81": ["Поиск по песням", "Поиск можно осуществлять по номеру песни, названию или тексту песни. Может искать по регулярному выражению, если ввести знак процента (%) вначале, и необязательные флаги перед ним. Игнорирует раскладку клавиатуры, а также здесь можно вписывать украинские букво-заменители, т.е. будут проверяться слова с такими заменами: $uaReplaces"]
  , "82": ["Сброс текста", "Да ладно тебе) это простая кнопка, по которой удалится текст, введённый в поисковую строку."]
  , "83": ["Поиск категорий", "Категориями названы списки, в которых объединены по каким-либо критериям зарегистрированные песни. Категория \"$zeroCatn\" всегда содержит в себе максимально полный список песен."]
  , "84": ["Сброс аппликатуры", "Быстро всю аппликатуру строки можно сбросить подтвердив это действиеs в окне предложения."]
  , "": ["", ""]
  
  , "max": 84
}







